app/Controllers/Books.php

SELECT *
FROM `books`
WHERE `books`.`id` = '5'
---
    public function edit($id)
    {
        $model = new BookModel();
        $data['book'] = $model->find($id);