app/Controllers/Dashboard.php

SELECT *
FROM `members`
---
    public function anggota()
    {
        $model = new MemberModel();
        $data['members'] = $model->findAll();

SELECT *
FROM `books`
---
    public function buku()
    {
        $model = new BookModel();
        $data['books'] = $model->findAll();

SELECT *
FROM `borrows`
---
    public function peminjaman()
    {
        $model = new BorrowModel();
        $data['borrows'] = $model->findAll();

SELECT *
FROM `loans`
---
    public function pengembalian()
    {
        $model = new LoanModel();
        $data['loans'] = $model->findAll();