app/Controllers/ImageController.php

SELECT *
FROM `images`
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `images`
---
    public function index()
    {
        $data = [
            'images' => $this->model->paginate(6),
            'pager' => $this->model->pager,
            'title' => 'Image Gallery - Seri Tutorial CodeIgniter 4: Fitur Upload @ qadrlabs.com'
        ];