app/Controllers/MemberController.php

    public function store()
    {
        $model = new MemberModel();

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email')
        ];

        $model->insert($data);
---
INSERT INTO `members` (`name`, `email`, `created_at`, `updated_at`) VALUES ('arpian', 'arpian@gmail.com', '2023-06-25 11:50:52', '2023-06-25 11:50:52')